Repository: lawrancej/logisim
Catalog: xlate/ru/doc/omegat-logisim-doc_ru-omegat.tmx
Source language: en
Languages: ru_ru

source: South edge, left side indicated by gray circle (input, bit width matches Select Bits attribute)
ru_ru: Южный край, левая сторона, отмечен серым кружком (вход, разрядность соответствует атрибуту Выбирающие биты)

source: // since the same logic is needed for the library's other components.
ru_ru: // раз уж такая логика приемлема для других библиотечных компонентов.

source: But some Logisim windows (particularly the Combinational Analysis window and the Application Preferences window) are not associated with projects.
ru_ru: Но некоторые окна Logisim (в частности, окна Комбинационный анализ и Настройки приложения) не связаны с проектами.

source: The Add Noise To Component Delays checkbox allows you to enable or disable the random noise that is added to the delays of components.
ru_ru: Флажок Добавлять шум к задержкам компонентов позволяет вам включать и выключать случайный шум, добавляемый к задержкам компонентов.

source: When the component is selected or being added, Alt-0 through Alt-9 alter its Data Bits attribute, the arrow keys alter its Facing attribute, and Alt with an arrow key alters its Label Location attribute.
ru_ru: Когда компонент выбран, или уже добавлен, комбинации от Alt-0 до Alt-9 меняют его атрибут Биты данных, клавиши со стрелками меняют его атрибут Направление, а клавиши со стрелками при зажатой Alt меняют его атрибут Направление метки.

source: Normally, one of the outputs will be 1, and the other two outputs will be 0.
ru_ru: Как правило, на одном из выходов будет 1, а на двух других - 0.

source: For the lowest-order 1, the output is 2 because if you index the bits starting from 0 for the lowest-order bit, the first 1 you will find is at index 2.
ru_ru: Для младшего 1 на выходе 2, потому что если вы нумеруете биты начиная с 0-го как с младшего бита, то первая 1, которую вы найдёте, будет под номером 2.

source: -template templateFile
ru_ru: -template файлШаблона

source: When connected to a point, this component has an effect only when the value at that point is the floating value (Z).
ru_ru: Когда подключен к точке, этот компонент имеет воздействие только когда значение в этой точке - плавающее (Z).

source: To practice using Logisim, let's build a XOR circuit - that is, a circuit that takes two inputs (which we'll call x and y) and outputs 0 if the inputs are the same and 1 if they are different.
ru_ru: Чтобы попрактиковаться в использовании Logisim, давайте построим схему Исключающее ИЛИ - то есть схему, которая имеет два входа (которые мы будем называть х и у ) и выдаёт на выходе 0, если значения на входах одинаковые, и 1, если они разные.

source: Some of the details may be slightly different since you're likely using a different system than mine.
ru_ru: Некоторые детали могут незначительно отличаться, поскольку вы возможно используете систему, отличную от моей.

source: Allows individual components to be placed into the current selection.
ru_ru: Позволяет помещать отдельные компоненты в текущее выделение.

source: For the analysis to be successful, each input must be attached to an input pin, and each output must be attached to an output pin.
ru_ru: Для успешного анализа каждый вход должен быть присоединён к входному контакту, а каждый выход - к выходному контакту.

source: The only reason to prefer ground and power is that they are standard electronic symbols.
ru_ru: Единственная причина предпочитать компоненты Земля и Питание в том, что они являются стандартными символами в электронике.

source: Typing the Backspace key will move to editing the value at the previous address.
ru_ru: Нажатие клавиши Backspace приведёт к редактированию значения по предыдущему адресу.

source: Every Logisim project is automatically a library that can be loaded into other Logisim projects: Just save it into a file and then load the library within another project.
ru_ru: Каждый проект Logisim - это автоматически библиотека, которая может быть загружена в другие проекты Logisim: просто сохраните его в файл, а затем загрузите как библиотеку в другом проекте.

source: // Display the current counter value centered within the rectangle.
ru_ru: // Отобразить текущее значение счётчика по центру прямоугольника.

source: The bit width of the value stored in the register.
ru_ru: Разрядность значения, хранящегося в регистре.

source: Assuming the output bit width exceeds the input bit width, this attribute configures what the additional output bits should be.
ru_ru: Предполагая, что разрядность выхода превышает разрядность входа, этот атрибут определяет, какими должны быть дополнительные биты выходного значения.

source: Tick Once
ru_ru: Один такт

source: A register stores a single multi-bit value, which is displayed in hexadecimal within its rectangle, and is emitted on its Q output.
ru_ru: Регистр хранит одно многобитное значение, которое отображается в шестнадцатеричном виде внутри его прямоугольника, и выдаётся на его выход Q.

source: Font
ru_ru: Шрифт

source: triangle on south edge (input, bit width 1)
ru_ru: треугольник на южном крае (вход, разрядность равна 1)

source: With the appearance for the 2:1 multiplexer drawn as above, the layout for the 4:1 multiplexer would then appear as the following.
ru_ru: При показанном выше внешнем виде мультиплексора 2:1, чертёж мультиплексора 4:1 будет выглядеть следующим образом.

source: The number of bits for the value that the pin handles.
ru_ru: Количество битов значения, с которым имеет дело контакт.

source: (All inputs and outputs have a defined bit width.)
ru_ru: (Все входы и выходы имеют определенную разрядность.)

source: Next: Opening Combinational Analysis.
ru_ru: Далее: Открытие окна Комбинационный анализ.

source: This input is present only if "separate load and store ports" is selected for the Data Interface attribute.
ru_ru: Этот вход представлен, только если "Раздельные порты чтения и записи" выбрано для атрибута Интерфейс данных.

source: The number of bits used to specify the value cannot exceed the component's bit width.
ru_ru: Количество битов, используемых для указания значения, не может превышать разрядность компонента.

source: Oscillation errors
ru_ru: Ошибки при возбуждении

source: Clicking an output pin has no effect, although the pin's attributes will be displayed.
ru_ru: Нажатие на выходной контакт не даёт эффекта, только атрибуты контакта будут отображены.

source: The supported characters for the buffer include all the printable ASCII characters, as well as space, newline, backspace, and control-L.
ru_ru: Поддерживаемые для буфера символы включают все печатаемые ASCII символы, а также пробел, символ перехода на новую строку, Backspace и Control-L.

source: The attributes for the tool are the same as for the label component.
ru_ru: Атрибуты для инструмента такие же, как для компонента Метка.

source: Go Out To State
ru_ru: Состояние уровнем выше

source: OR
ru_ru: ИЛИ

source: Data: When the clock triggers while load is 1 and count is 0, the counter's value changes to the value found at this input.
ru_ru: Данные: когда срабатывает тактовый вход при 1 на входе загрузка и 0 на входе счёт, значение счётчика сменится на значение, поступившее на этот вход.

source: When the component is selected or being added, the arrow keys alter its Facing attribute.
ru_ru: Когда компонент выбран, или уже добавлен, клавиши со стрелками меняют его атрибут Направление.

source: Illustrates how to define a library.
ru_ru: Показывает, как объявить библиотеку.

source: In the above examples involving the input 11010100, the south output is 1 in all cases.
ru_ru: В примерах выше для входного значение 11010100 на южном выходе 1 во всех случаях.

source: The name must not match any existing circuits in the project.
ru_ru: Имя не должно совпадать с именем существующей в проекте схемы.

source: Asynchronous set: When 1 or undefined, this input has no effect.
ru_ru: Асинхронная установка: если на этом входе 0 или неопределённое значение, то он не имеет эффекта.

source: Each value has the bit underlined that will change for the next value in the sequence.
ru_ru: Каждое значение имеет подчёркнутый бит, который изменится для следующего значения в последовательности.

source: This component allows the circuit to read keys typed from the keyboard - as long as the keys are representable in the 7-bit ASCII code.
ru_ru: Этот компонент позволяет схеме считывать символы с клавиатуры, если только они представимы в 7-разрядном ASCII коде.

source: The naive approach would be to open Logisim and load that library instead; or you might simply remove the adder-master.circ file and rename adder-query.circ to be named adder-master.circ instead.
ru_ru: Наивным подходом будет открыть Logisim и загрузить эту библиотеку; или вы можете просто удалить файл adder-master.circ и переименовать adder-query.circ в adder-master.circ вместо него.

source: If the input is unspecified (i.e., floating), then the output will also be unspecified - unless the "Gate Output When Undefined" option is "Error for undefined inputs," in which case the output is an error.
ru_ru: Если значение на входе не определено (например плавающее), то значение на выходе тоже будет не определено, если только параметр "Выход элемента при неопределённости" не имеет значения "Ошибка для неопределённых входов" - в таком случае на выходе будет ошибка.

source: West edge, top pin, labeled with a triangle (input, bit width 1)
ru_ru: Западный край, верхний контакт, отмечен треугольником (вход, разрядность равна 1)

source: Introduced:
ru_ru: Введён в:

source: XOR/XNOR/Even/Odd Gate
ru_ru: Элементы Исключающее ИЛИ/Исключающее ИЛИ-НЕ/Нечётность/Чётность

source: Now suppose we want to build a 4-to-1 multiplexer using instances of our 2-to-1 multiplexer.
ru_ru: Теперь предположим, что мы хотим построить мультиплексор 4-в-1, используя экземпляры нашего мультиплексора 2-в-1.

source: After a while, Logisim will simply give up and show an "Oscillation apparent" message telling you that it believes that the circuit is oscillating.
ru_ru: Через некоторое время Logisim просто сдастся и покажет сообщение "Обнаружено возбуждение", говорящее вам, что он считает, что схема возбуждается.

source: The next value is 0 (if incrementing - the maximum value if decrementing)
ru_ru: При увеличении - следующее значение 0; при уменьшении - максимальное значение

source: * method just does some bit twiddling; it doesn't have much to do with
ru_ru: * метод просто выполняет некоторые манипуляции с битами; ему не надо делать ничего особенного с

source: A carry value to add into the sum.
ru_ru: Значение переноса для прибавления к сумме.

source: (The points it identifies as being involved are those that were touched in the last 25% of the iterations.) Thus, it could erroneously report oscillation, particularly if you are working with an exceptionally large circuit; but it would be one that is larger than any I have built using Logisim.
ru_ru: (Точки, которые он определяет как участвовавшие - это те, которые были затронуты как минимум в 25% итераций.) Таким образом, он мог бы ошибочно сообщить о возбуждении, например, если вы работаете с исключительно большой схемой; но она должна быть больше, чем любая построенная мной в Logisim.

source: Libraries and Attributes
ru_ru: Библиотеки и атрибуты

source: Rectangular:
ru_ru: Прямоугольные:

source: As you proceed, you'll see the dots turn from blue to light or dark green.
ru_ru: Когда вы сделаете это, вы увидите, что точки стали из синих светло- или тёмно-зелёными.

source: *North edge, other pins (input, bit width matches Data Bits attribute)
ru_ru: *Северный край, остальные контакты (вход, разрядность соответствует атрибуту Биты данных)

source: Dragging the mouse continues to move the knob and update the outputs, keeping the knob within the joystick's area.
ru_ru: Перетаскивание мыши продолжает двигать рукоятку и обновляет выходы; рукоятка остаётся в пределах области джойстика.

source: South edge, center end (input, bit width 1)
ru_ru: Южный край, центральный контакт (вход, разрядность равна 1)

source: In addition, all components in the Plexers, Arithmetic, and Memory libraries will provide information about their inputs and outputs via tips.
ru_ru: Кроме того, все компоненты библиотек Плексоры, Арифметика и Память предоставляют информацию о своих входах и выходах через подсказки.

source: You may want to decrease the number of iterations if you are working with a circuit that is prone to oscillating and you are using an unusually slow processor.
ru_ru: Вам может понадобиться уменьшить число итераций, если вы работаете со схемой, предрасположенной к возбуждению, и вы используете необыкновенно медленный процессор.

source: It's important that you connect wires to the right places.
ru_ru: Важно, чтобы вы подключили провода к правильным местам.

source: West edge, marked by triangle (input, bit width 1)
ru_ru: Западный край, отмечен треугольником (вход, разрядность равна 1)

source: But if we edit the Gate Size attribute just after selecting the tool (before placing its AND gate into the circuit), we'll be changing the attributes for the tool, so that future AND gates added using the tool would be narrow instead.
ru_ru: Но если мы изменяем атрибут Размер элемента сразу после выбора инструмента (до размещения элемента И в схеме), то мы изменяем атрибуты для инструмента, так что в дальнейшем элементы И, добавленные с помощью этого инструмента, будут узкими, а не широкими.

source: package com.cburch.gray; import java.net.URL; import javax.swing.ImageIcon; import com.cburch.logisim.data.Attribute; import com.cburch.logisim.data.BitWidth; import com.cburch.logisim.data.Bounds; import com.cburch.logisim.data.Direction; import com.cburch.logisim.instance.Instance; import com.cburch.logisim.instance.InstanceFactory; import com.cburch.logisim.instance.InstancePainter; import com.cburch.logisim.instance.InstanceState; import com.cburch.logisim.instance.Port; import com.cburch.logisim.instance.StdAttr; import com.cburch.logisim.util.GraphicsUtil; import com.cburch.logisim.util.StringUtil; /** Manufactures a counter that iterates over Gray codes.
ru_ru: package com.cburch.gray; import java.net.URL; import javax.swing.ImageIcon; import com.cburch.logisim.data.Attribute; import com.cburch.logisim.data.BitWidth; import com.cburch.logisim.data.Bounds; import com.cburch.logisim.data.Direction; import com.cburch.logisim.instance.Instance; import com.cburch.logisim.instance.InstanceFactory; import com.cburch.logisim.instance.InstancePainter; import com.cburch.logisim.instance.InstanceState; import com.cburch.logisim.instance.Port; import com.cburch.logisim.instance.StdAttr; import com.cburch.logisim.util.GraphicsUtil; import com.cburch.logisim.util.StringUtil; /** Создаёт счётчик, который пробегает по очереди коды Грея.

source: The German translation was introduced with Logisim 2.6.1 and remains current.
ru_ru: Немецкий перевод был представлен в Logisim 2.6.1 и остаётся актуальным.

source: When you create a project, it automatically includes several libraries:
ru_ru: При создании проекта он автоматически включает в себя несколько библиотек:

source: West edge, marked by a triangle (input, bit width 1)
ru_ru: Западный край, отмечен треугольником (вход, разрядность равна 1)

source: East edge, lower pin (output, bit width 1)
ru_ru: Восточный край, нижний контакт (выход, разрядность равна 1)

source: Rotate To Fit: If checked, then Logisim will rotate each circuit by 90 degrees when the circuit is too large to fit onto the page and it does not need to be scaled as small when rotated 90 degrees.
ru_ru: Повернуть для подгонки: если установлено, то Logisim будет поворачивать каждую схему на 90 градусов, когда схема слишком велика, чтобы уместиться на странице, и её не нужно так же сильно масштабировать, когда она повёрнута на 90 градусов.

source: The Insert and MenuKey-D keys will create a duplicate of the currently selected components.
ru_ru: Клавиши Insert и MenuKey-D создают дубликат выделенных в данный момент компонентов.

source: If you want to build circuits with more sophisticated features, then you should navigate through the rest of the help system to see what else you can do.
ru_ru: Если вы хотите строить схемы с более сложными возможностями, то вам стоит походить по остальным разделам системы помощи, чтобы увидеть, что ещё вы можете делать.

source: does not normally print such an announcement, your work based on
ru_ru: обычно не выводит подобное объявление, то ваше произведение, основанное на

source: the Program is not required to print an announcement.) These requirements apply to the modified work as a whole.
ru_ru: Программе, не обязано выводить объявление.) Эти требования применяются к модифицированному произведению в целом.

source: Note that any combinations that aren't listed simply use the currently selected tool.
ru_ru: Обратите внимание, что любые комбинации, которые не перечислены, просто используют выбранный в текущий момент инструмент.

source: Logical Left: All bits in data are shifted up dist places, with the bottom dist places filled with 0's.
ru_ru: Логический левый: все биты в данные сдвигаются вверх на дистанция позиций, а нижние дистанция позиций заполняются нулями.

source: Next: Step 4: Testing your circuit
ru_ru: Далее: Шаг 4: Проверка вашей схемы

source: Gates Library
ru_ru: Библиотека Элементы

source: When the component is selected or being added, the hexademical digits '0' through '9' and 'a' through 'f' alter its Value attribute, Alt-0 through Alt-9 alter its Data Bits attribute, and the arrow keys alter its Facing attribute.
ru_ru: Когда компонент выбран, или уже добавлен, клавиши с шестнадцатеричными цифрами от 0 до 9 и от a до f меняют его атрибут Значение, комбинации от Alt-0 до Alt-9 меняют его атрибут Биты данных, а клавиши со стрелками меняют его атрибут Направление.

source: Typing the space bar will move to editing the value at the following address.
ru_ru: Нажатие пробела приведёт к редактированию значения по следующему адресу.

source: North edge, labeled c in (input, bit width matches Data Bits attribute)
ru_ru: Северный край, отмечен c in (вход, разрядность соответствует атрибуту Биты данных)

source: West edge, south pin (output, bit width matches Bit Width attribute)
ru_ru: Западный край, южный контакт (выход, разрядность соответствует атрибуту Разрядность)

source: The lower dataBits bits of the dividend (that is, the first operand for the division).
ru_ru: Младшие битыДанных битов делимого (то есть первый операнд деления).

source: Of course, you are always free to analyze a circuit again; and, as we will see later, you can replace the circuit with a circuit corresponding to what appears in the Combinational Analysis window.
ru_ru: Конечно, вы всегда можете проанализировать схему ещё раз; и, как мы увидим позже, вы можете заменить схему схемой, соответствующей тому, что находится в окне Комбинационный анализ.

source: Some or all of the bits may not be specified.
ru_ru: Некоторые или все биты могут быть не определены.

source: The high level value indicates that the flip-flop should update continuously whenever the clock input is 1.
ru_ru: Значение Высокий уровень означает, что триггер должен обновляться непрерывно, пока на тактовом входе 1.

source: Create an oval through dragging from one corner of its bounding box to the opposite corner.
ru_ru: Создать овал путём перетаскивания от одного угла ограничивающей его рамки до противоположного.

source: // First we retrieve the value being fed into the input.
ru_ru: // Сначала мы получаем значение, поданное на вход.

source: Sun's Java API (obviously)
ru_ru: Sun Java API (само собой)

source: Columns
ru_ru: Столбцы

source: Next: Gate delays.
ru_ru: Далее: Задержки логических элементов.

source: In
ru_ru: В

source: Next: Logisim libraries.
ru_ru: Далее: Библиотеки Logisim.

source: Sets the currently displayed circuit to be the project's main circuit. (This menu item will be grayed out if the current circuit is already the project's main circuit.) The only significance of the main circuit is that it is the circuit that first appears when a project file is opened.
ru_ru: Устанавливает отображаемую в данный момент схему как главную схему проекта. (Этот пункт меню будет недоступен, если текущая схема - уже главная схема проекта.) Единственным значением главной схемы является то, что эта схема появляется первой, когда открывается файл проекта.

source: /** Computes the current output for this component.
ru_ru: /** Вычисляет текущее значение на выходе для этого компонента.

source: Maximum Value
ru_ru: Максимальное значение

source: That is, it will compute as many low-order bits as possible.
ru_ru: То есть он будет вычислять столько младших битов, сколько возможно.

source: The Poke Tool is for manipulating the current values associated with components.
ru_ru: Инструмент Нажатие служит для работы с текущими значениями, связанными с компонентами.

source: For ROM components, which have the memory contents as part of the attribute value, you can alternatively access the hex editor by clicking the corresponding attribute value.
ru_ru: Для компонентов ПЗУ, содержимое памяти которых - часть значения атрибута, вы можете получить доступ к шестнадцатеричному редактору, нажав на соответствующее значение атрибута.

source: Beta 13 (in Base library, moved to Wiring in 2.7.0)
ru_ru: Beta 13 (в библиотеке Базовые, перемещён в библиотеку Проводка в 2.7.0)

source: The Guide to Being a Logisim User, which you are reading now, is the official reference for Logisim's features.
ru_ru: Руководство "Как стать пользователем Logisim", которое вы сейчас читаете - это официальный обзор возможностей Logisim.

source: The location of the split ends relative to the combined end.
ru_ru: Расположение разделённых концов относительно объединённого конца.

source: The other of the two values to add.
ru_ru: Второе значение для сложения.

source: We can quickly dispose of the explorer pane and the attribute table: We won't be examining them in this tutorial, and you can just ignore them.
ru_ru: Мы можем быстро разделаться с панелью проводника и таблицей атрибутов: мы не будем рассматривать их в этом пособии, и вы можете просто игнорировать их.

source: These icons are released under the Creative Commons Attribution 3.0 License, and they cannot be redistributed under the terms of the GPL.
ru_ru: Эти значки распространяются по лицензии Creative Commons Attribution 3.0 License, и они не могут распространяться в соответствии с условиями GPL.

source: You can select which output's minimized expression you want to view using the selector at top, and you can indicate whether you want to derive a sum-of-products expression or a product-of-sums expression using the selector below.
ru_ru: Вы можете выбрать, для какого выхода вы хотите просматривать минимизированное выражение с помощью списка сверху, и можете указать, какое выражение вы хотите получить - сумму произведений или произведение сумм, с помощью списка снизу.

source: The primary difference is that if the circuit is used as a subcircuit component, then an output pin will be a part of that interface, whereas a probe is not.
ru_ru: Основная разница в том, что если схема используется в качестве подсхемы, то выходной контакт будет частью этого интерфейса, тогда как датчик не будет.

source: c) Accompany it with the information you received as to the offer
ru_ru: c) Сопроводите ее информацией, полученной вами в качестве предложения

source: The Karnaugh map will also display the currently selected terms for the minimized expression as solid semitransparent rounded rectangles.
ru_ru: Карта Карно будет также показывать выбранные в данный момент для минимизированного выражения термы в виде сплошных полупрозрачных скругленных прямоугольников.
